{"config": [{"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activation": "relu", "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "nb_filter": 32, "dim_ordering": "tf", "W_constraint": null, "batch_input_shape": [null, 480, 640, 3], "bias": true, "name": "convolution2d_1", "input_dtype": "float32", "nb_row": 3, "nb_col": 3, "border_mode": "same", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activation": "relu", "trainable": true, "init": "glorot_uniform", "nb_filter": 32, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "bias": true, "name": "convolution2d_2", "nb_row": 3, "nb_col": 3, "border_mode": "valid", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activation": "relu", "trainable": true, "init": "glorot_uniform", "nb_filter": 64, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "bias": true, "name": "convolution2d_3", "nb_row": 3, "nb_col": 3, "border_mode": "same", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activation": "relu", "trainable": true, "init": "glorot_uniform", "nb_filter": 64, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "bias": true, "name": "convolution2d_4", "nb_row": 3, "nb_col": 3, "border_mode": "valid", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activation": "relu", "trainable": true, "init": "glorot_uniform", "nb_filter": 128, "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "bias": true, "name": "convolution2d_5", "nb_row": 3, "nb_col": 3, "border_mode": "same", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [8, 8], "trainable": true, "pool_size": [8, 8], "name": "maxpooling2d_3", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "output_dim": 512, "W_constraint": null, "bias": true, "name": "dense_1", "b_constraint": null, "input_dim": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "output_dim": 10, "W_constraint": null, "bias": true, "name": "dense_2", "b_constraint": null, "input_dim": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_2"}}], "class_name": "Sequential", "keras_version": "1.1.2"}